20260119194446-reading_input.org
:PROPERTIES:
:ID:       06239cef-4870-440c-8b9a-02e12062e73a
:END:
#+title: Reading Input

* Reading Input
** Scanner Example

#+BEGIN_SRC java
import java.util.Scanner;
public class ComputeArea {
    public static void main(String[] args) {
        // Create a Scanner Object
        Scanner input = new Scanner(System.in);
        // Prompt the user to enter a radius
        System.out.print("Enter a number for radius: ");
        double radius = input.nextDouble();
        // Step 2: Compute Area
        double area = radius * radius * 3.14159;
        // Step 3: Display the area
        System.out.println("The area for the circle of radius " + radius + " is " + area);
    }
}
#+END_SRC

** Multiple inputs
#+BEGIN_SRC java
import java.util.Scanner;
public class ComputeAverage {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);

        // Prompt the user to enter three numbers
        System.out.print("Enter three numbers: ");

        double num1 = input.nextInt();
        double num2 = input.nextInt();
        double num3 = input.nextInt();

        // Compute average
        double average = (num1 + num2 + num3) / 3;


        System.out.println("The average of " + num1 + " " + num2 + " " + num3 + " is " + average);
    }
}
#+END_SRC

** Reading Numbers

| Method       | Data Type Read | Description                                   |
|--------------+----------------+-----------------------------------------------|
| nextByte()   | byte           | Reads a byte-sized integer value              |
| nextShort()  | short          | Reads a short-sized integer value             |
| nextInt()    | int            | Reads an integer value                        |
| nextLong()   | long           | Reads a long integer value                    |
| nextFloat()  | float          | Reads a floating-point number                 |
| nextDouble() | double         | Reads a double-precision floating-point value |

If you enter a value with an *incorrect* *range* or *format*, a runtime error would occur:
#+BEGIN_SRC shell
Enter a number for radius: a
Exception in thread "main" java.util.InputMismatchException
        at java.base/java.util.Scanner.throwFor(Scanner.java:939)
        at java.base/java.util.Scanner.next(Scanner.java:1594)
        at java.base/java.util.Scanner.nextDouble(Scanner.java:2564)
        at ComputeArea.main(ComputeArea.java:10)
#+END_SRC
