20260119194446-reading_input.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 09:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Reading Input</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Reading Input</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcad708d">1. Reading Input</a>
<ul>
<li><a href="#org86e2e12">1.1. Scanner Example</a></li>
<li><a href="#org6ff4217">1.2. Multiple inputs</a></li>
<li><a href="#org224e684">1.3. Reading Numbers</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgcad708d" class="outline-2">
<h2 id="orgcad708d"><span class="section-number-2">1.</span> Reading Input</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org86e2e12" class="outline-3">
<h3 id="org86e2e12"><span class="section-number-3">1.1.</span> Scanner Example</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-java">import java.util.Scanner;
public class ComputeArea {
    public static void main(String[] args) {
        // Create a Scanner Object
        Scanner input = new Scanner(System.in);
        // Prompt the user to enter a radius
        System.out.print("Enter a number for radius: ");
        double radius = input.nextDouble();
        // Step 2: Compute Area
        double area = radius * radius * 3.14159;
        // Step 3: Display the area
        System.out.println("The area for the circle of radius " + radius + " is " + area);
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ff4217" class="outline-3">
<h3 id="org6ff4217"><span class="section-number-3">1.2.</span> Multiple inputs</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-java">import java.util.Scanner;
public class ComputeAverage {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);

        // Prompt the user to enter three numbers
        System.out.print("Enter three numbers: ");

        double num1 = input.nextInt();
        double num2 = input.nextInt();
        double num3 = input.nextInt();

        // Compute average
        double average = (num1 + num2 + num3) / 3;


        System.out.println("The average of " + num1 + " " + num2 + " " + num3 + " is " + average);
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org224e684" class="outline-3">
<h3 id="org224e684"><span class="section-number-3">1.3.</span> Reading Numbers</h3>
<div class="outline-text-3" id="text-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Method</th>
<th scope="col" class="org-left">Data Type Read</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">nextByte()</td>
<td class="org-left">byte</td>
<td class="org-left">Reads a byte-sized integer value</td>
</tr>

<tr>
<td class="org-left">nextShort()</td>
<td class="org-left">short</td>
<td class="org-left">Reads a short-sized integer value</td>
</tr>

<tr>
<td class="org-left">nextInt()</td>
<td class="org-left">int</td>
<td class="org-left">Reads an integer value</td>
</tr>

<tr>
<td class="org-left">nextLong()</td>
<td class="org-left">long</td>
<td class="org-left">Reads a long integer value</td>
</tr>

<tr>
<td class="org-left">nextFloat()</td>
<td class="org-left">float</td>
<td class="org-left">Reads a floating-point number</td>
</tr>

<tr>
<td class="org-left">nextDouble()</td>
<td class="org-left">double</td>
<td class="org-left">Reads a double-precision floating-point value</td>
</tr>
</tbody>
</table>

<p>
If you enter a value with an <b>incorrect</b> <b>range</b> or <b>format</b>, a runtime error would occur:
</p>
<div class="org-src-container">
<pre class="src src-shell">Enter a number for radius: a
Exception in thread "main" java.util.InputMismatchException
        at java.base/java.util.Scanner.throwFor(Scanner.java:939)
        at java.base/java.util.Scanner.next(Scanner.java:1594)
        at java.base/java.util.Scanner.nextDouble(Scanner.java:2564)
        at ComputeArea.main(ComputeArea.java:10)
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
